{
  "config": [
    {
      "config": {
        "dtype": "float32",
        "function_type": "lambda",
        "function": [ "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faPC:/Users/aksha/Box Sync/MyDrive/Projects/Akshay-GitHub/Car-ND/Project_3/model.py\u00da\b<lambda>\u0015\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null ],
        "trainable": true,
        "output_shape": null,
        "name": "lambda_1",
        "batch_input_shape": [ null, 160, 320, 3 ],
        "arguments": { },
        "output_shape_type": "raw"
      },
      "class_name": "Lambda"
    },
    {
      "config": {
        "name": "cropping2d_1",
        "data_format": "channels_last",
        "trainable": true,
        "cropping": [
          [ 70, 25 ],
          [ 0, 0 ]
        ]
      },
      "class_name": "Cropping2D"
    },
    {
      "config": {
        "name": "conv2d_1",
        "padding": "same",
        "filters": 16,
        "kernel_size": [ 8, 8 ],
        "activation": "linear",
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "strides": [ 4, 4 ],
        "bias_initializer": {
          "config": { },
          "class_name": "Zeros"
        },
        "activity_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "kernel_initializer": {
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "data_format": "channels_last",
        "bias_constraint": null,
        "use_bias": true,
        "dilation_rate": [ 1, 1 ]
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "alpha": 1.0,
        "name": "elu_1",
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "name": "conv2d_2",
        "padding": "same",
        "filters": 32,
        "kernel_size": [ 5, 5 ],
        "activation": "linear",
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "strides": [ 2, 2 ],
        "bias_initializer": {
          "config": { },
          "class_name": "Zeros"
        },
        "activity_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "kernel_initializer": {
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "data_format": "channels_last",
        "bias_constraint": null,
        "use_bias": true,
        "dilation_rate": [ 1, 1 ]
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "alpha": 1.0,
        "name": "elu_2",
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "name": "conv2d_3",
        "padding": "same",
        "filters": 64,
        "kernel_size": [ 5, 5 ],
        "activation": "linear",
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "strides": [ 2, 2 ],
        "bias_initializer": {
          "config": { },
          "class_name": "Zeros"
        },
        "activity_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "kernel_initializer": {
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "data_format": "channels_last",
        "bias_constraint": null,
        "use_bias": true,
        "dilation_rate": [ 1, 1 ]
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "flatten_1",
        "trainable": true
      },
      "class_name": "Flatten"
    },
    {
      "config": {
        "name": "dropout_1",
        "rate": 0.2,
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "alpha": 1.0,
        "name": "elu_3",
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "activation": "linear",
        "units": 512,
        "bias_constraint": null,
        "kernel_initializer": {
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "bias_initializer": {
          "config": { },
          "class_name": "Zeros"
        },
        "activity_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "name": "dense_1",
        "use_bias": true
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "dropout_2",
        "rate": 0.5,
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "alpha": 1.0,
        "name": "elu_4",
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "activation": "linear",
        "units": 50,
        "bias_constraint": null,
        "kernel_initializer": {
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "bias_initializer": {
          "config": { },
          "class_name": "Zeros"
        },
        "activity_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "name": "dense_2",
        "use_bias": true
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "alpha": 1.0,
        "name": "elu_5",
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "activation": "linear",
        "units": 1,
        "bias_constraint": null,
        "kernel_initializer": {
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "bias_initializer": {
          "config": { },
          "class_name": "Zeros"
        },
        "activity_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "name": "dense_3",
        "use_bias": true
      },
      "class_name": "Dense"
    }
  ],
  "keras_version": "2.0.3",
  "class_name": "Sequential",
  "backend": "tensorflow"
}