{
    "config": [
        {
            "config": {
                "dtype": "float32",
                "name": "lambda_1",
                "arguments": {
                },
                "trainable": true,
                "batch_input_shape": [
                    null,
                    160,
                    320,
                    3
                ],
                "function_type": "lambda",
                "output_shape": null,
                "function": [
                    "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0015\u0000\u0000\u0000s\u0000\u0000\u0000\u0000",
                    null,
                    null
                ],
                "output_shape_type": "raw"
            },
            "class_name": "Lambda"
        },
        {
            "config": {
                "name": "cropping2d_1",
                "data_format": "channels_last",
                "trainable": true,
                "cropping": [
                    [
                        70,
                        25
                    ],
                    [
                        0,
                        0
                    ]
                ]
            },
            "class_name": "Cropping2D"
        },
        {
            "config": {
                "dilation_rate": [
                    1,
                    1
                ],
                "kernel_constraint": null,
                "activation": "linear",
                "name": "conv2d_1",
                "bias_constraint": null,
                "trainable": true,
                "padding": "same",
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {
                    },
                    "class_name": "Zeros"
                },
                "kernel_size": [
                    8,
                    8
                ],
                "kernel_initializer": {
                    "config": {
                        "scale": 1.0,
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "seed": null
                    },
                    "class_name": "VarianceScaling"
                },
                "use_bias": true,
                "activity_regularizer": null,
                "kernel_regularizer": null,
                "strides": [
                    4,
                    4
                ],
                "data_format": "channels_last",
                "filters": 16
            },
            "class_name": "Conv2D"
        },
        {
            "config": {
                "alpha": 1.0,
                "name": "elu_1",
                "trainable": true
            },
            "class_name": "ELU"
        },
        {
            "config": {
                "dilation_rate": [
                    1,
                    1
                ],
                "kernel_constraint": null,
                "activation": "linear",
                "name": "conv2d_2",
                "bias_constraint": null,
                "trainable": true,
                "padding": "same",
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {
                    },
                    "class_name": "Zeros"
                },
                "kernel_size": [
                    5,
                    5
                ],
                "kernel_initializer": {
                    "config": {
                        "scale": 1.0,
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "seed": null
                    },
                    "class_name": "VarianceScaling"
                },
                "use_bias": true,
                "activity_regularizer": null,
                "kernel_regularizer": null,
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last",
                "filters": 32
            },
            "class_name": "Conv2D"
        },
        {
            "config": {
                "alpha": 1.0,
                "name": "elu_2",
                "trainable": true
            },
            "class_name": "ELU"
        },
        {
            "config": {
                "dilation_rate": [
                    1,
                    1
                ],
                "kernel_constraint": null,
                "activation": "linear",
                "name": "conv2d_3",
                "bias_constraint": null,
                "trainable": true,
                "padding": "same",
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {
                    },
                    "class_name": "Zeros"
                },
                "kernel_size": [
                    5,
                    5
                ],
                "kernel_initializer": {
                    "config": {
                        "scale": 1.0,
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "seed": null
                    },
                    "class_name": "VarianceScaling"
                },
                "use_bias": true,
                "activity_regularizer": null,
                "kernel_regularizer": null,
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last",
                "filters": 64
            },
            "class_name": "Conv2D"
        },
        {
            "config": {
                "name": "flatten_1",
                "trainable": true
            },
            "class_name": "Flatten"
        },
        {
            "config": {
                "name": "dropout_1",
                "trainable": true,
                "rate": 0.2
            },
            "class_name": "Dropout"
        },
        {
            "config": {
                "alpha": 1.0,
                "name": "elu_3",
                "trainable": true
            },
            "class_name": "ELU"
        },
        {
            "config": {
                "kernel_constraint": null,
                "activation": "linear",
                "name": "dense_1",
                "bias_constraint": null,
                "trainable": true,
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {
                    },
                    "class_name": "Zeros"
                },
                "kernel_initializer": {
                    "config": {
                        "scale": 1.0,
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "seed": null
                    },
                    "class_name": "VarianceScaling"
                },
                "units": 512,
                "use_bias": true,
                "activity_regularizer": null,
                "kernel_regularizer": null
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "name": "dropout_2",
                "trainable": true,
                "rate": 0.5
            },
            "class_name": "Dropout"
        },
        {
            "config": {
                "alpha": 1.0,
                "name": "elu_4",
                "trainable": true
            },
            "class_name": "ELU"
        },
        {
            "config": {
                "kernel_constraint": null,
                "activation": "linear",
                "name": "dense_2",
                "bias_constraint": null,
                "trainable": true,
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {
                    },
                    "class_name": "Zeros"
                },
                "kernel_initializer": {
                    "config": {
                        "scale": 1.0,
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "seed": null
                    },
                    "class_name": "VarianceScaling"
                },
                "units": 50,
                "use_bias": true,
                "activity_regularizer": null,
                "kernel_regularizer": null
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "alpha": 1.0,
                "name": "elu_5",
                "trainable": true
            },
            "class_name": "ELU"
        },
        {
            "config": {
                "kernel_constraint": null,
                "activation": "linear",
                "name": "dense_3",
                "bias_constraint": null,
                "trainable": true,
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {
                    },
                    "class_name": "Zeros"
                },
                "kernel_initializer": {
                    "config": {
                        "scale": 1.0,
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "seed": null
                    },
                    "class_name": "VarianceScaling"
                },
                "units": 1,
                "use_bias": true,
                "activity_regularizer": null,
                "kernel_regularizer": null
            },
            "class_name": "Dense"
        }
    ],
    "backend": "tensorflow",
    "keras_version": "2.0.3",
    "class_name": "Sequential"
}