{
  "keras_version": "2.0.3",
  "config": [
    {
      "config": {
        "trainable": true,
        "dtype": "float32",
        "batch_input_shape": [
          null,
          160,
          320,
          3
        ],
        "function_type": "lambda",
        "name": "lambda_1",
        "output_shape_type": "raw",
        "output_shape": null,
        "arguments": {},
        "function": [
          "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000",
          null,
          null
        ]
      },
      "class_name": "Lambda"
    },
    {
      "config": {
        "cropping": [
          [
            70,
            25
          ],
          [
            0,
            0
          ]
        ],
        "name": "cropping2d_1",
        "data_format": "channels_last",
        "trainable": true
      },
      "class_name": "Cropping2D"
    },
    {
      "config": {
        "data_format": "channels_last",
        "padding": "same",
        "trainable": true,
        "name": "conv2d_1",
        "kernel_initializer": {
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "kernel_size": [
          8,
          8
        ],
        "activity_regularizer": null,
        "use_bias": true,
        "dilation_rate": [
          1,
          1
        ],
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "bias_constraint": null,
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "filters": 16,
        "activation": "linear",
        "strides": [
          4,
          4
        ]
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "elu_1",
        "alpha": 1.0,
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "data_format": "channels_last",
        "padding": "same",
        "trainable": true,
        "name": "conv2d_2",
        "kernel_initializer": {
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "kernel_size": [
          5,
          5
        ],
        "activity_regularizer": null,
        "use_bias": true,
        "dilation_rate": [
          1,
          1
        ],
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "bias_constraint": null,
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "filters": 32,
        "activation": "linear",
        "strides": [
          2,
          2
        ]
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "elu_2",
        "alpha": 1.0,
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "data_format": "channels_last",
        "padding": "same",
        "trainable": true,
        "name": "conv2d_3",
        "kernel_initializer": {
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "kernel_size": [
          5,
          5
        ],
        "activity_regularizer": null,
        "use_bias": true,
        "dilation_rate": [
          1,
          1
        ],
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "bias_constraint": null,
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "filters": 64,
        "activation": "linear",
        "strides": [
          2,
          2
        ]
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "flatten_1",
        "trainable": true
      },
      "class_name": "Flatten"
    },
    {
      "config": {
        "name": "dropout_1",
        "rate": 0.2,
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "name": "elu_3",
        "alpha": 1.0,
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "bias_regularizer": null,
        "kernel_initializer": {
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "name": "dense_1",
        "activity_regularizer": null,
        "use_bias": true,
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "bias_constraint": null,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "units": 512,
        "activation": "linear"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "dropout_2",
        "rate": 0.5,
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "name": "elu_4",
        "alpha": 1.0,
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "bias_regularizer": null,
        "kernel_initializer": {
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "name": "dense_2",
        "activity_regularizer": null,
        "use_bias": true,
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "bias_constraint": null,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "units": 50,
        "activation": "linear"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "elu_5",
        "alpha": 1.0,
        "trainable": true
      },
      "class_name": "ELU"
    },
    {
      "config": {
        "bias_regularizer": null,
        "kernel_initializer": {
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "name": "dense_3",
        "activity_regularizer": null,
        "use_bias": true,
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "bias_constraint": null,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "units": 1,
        "activation": "linear"
      },
      "class_name": "Dense"
    }
  ],
  "class_name": "Sequential",
  "backend": "tensorflow"
}