{"config": [{"config": {"dtype": "float32", "output_shape": null, "arguments": {}, "name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa:C:/Users/em8273/Documents/GitHub/Car-ND/Project_3/model.py\u00da\b<lambda>\u000e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"kernel_size": [8, 8], "dilation_rate": [1, 1], "padding": "same", "name": "conv2d_1", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "filters": 16, "strides": [4, 4], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "padding": "same", "name": "conv2d_2", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "filters": 32, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "padding": "same", "name": "conv2d_3", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "filters": 64, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"units": 512, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"units": 50, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"units": 1, "kernel_constraint": null, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.3", "class_name": "Sequential"}